Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-IT/tmx_teil_1.tmx
Source language: en
Languages: it

source: Processing machines using processing gases for the treatment of objects
it: Macchine di lavorazione che utilizzano gas di lavorazione per il trattamento di oggetti

source: Industrial tin openers
it: Apriscatole industriali

source: Industrial washing machines
it: Lavatrici industriali

source: Braking components for machines
it: Componenti di frenatura per macchine

source: Movable vibrating conveyors
it: Trasportatori a vibrazione mobili

source: Sprayers [machines] for agricultural use in spraying fungicide
it: Nebulizzatori [macchine] per uso agricolo per spruzzare anticrittogamici

source: Sprayers [machines] for agricultural use in spraying herbicide
it: Nebulizzatori [macchine] per uso agricolo per spruzzare diserbanti

source: Couplings of metal for hydraulic apparatus
it: Giunti in metallo per apparecchi idraulici

source: Power-operated jig saws
it: Seghe da traforo elettriche

source: Compressors for dehumidifying machines
it: Compressori per macchine deumidificatrici

source: Vertical bucket conveyors
it: Trasportatori a tazze verticali

source: Vibrating separators [machines]
it: Separatori vibranti [macchine]

source: Hoppers [machines]
it: Tramogge [macchine]

source: Horticultural machines
it: Macchine per l'orticoltura

source: Knives, electric
it: Coltelli elettrici

source: Electric power generators for ships
it: Generatori di energia elettrica per navi

source: Electrical drives for machines
it: Azionamenti elettrici per macchine

source: Electric generator power sets
it: Set di generatori elettrici

source: Splines (sliding -) [parts of machines]
it: Scanalature (scorrevoli -) [parti di macchine]

source: Multiple nut runner motors
it: Motori per giradadi multipli

source: Multiple shell grippers [machines]
it: Benne a spicchi multipli [macchine]

source: Geared electric motors for water craft
it: Motori elettrici a ingranaggi per imbarcazioni

source: Augers [machines]
it: Trivelle [macchine]

source: Pumps for aerosols
it: Pompe per aerosol

source: Punches for use with machine tools
it: Punzoni per macchine utensili

source: Machines for use in assembly
it: Macchine per assemblaggio

source: Machines for use in making whipped cream [electric, kitchen]
it: Macchine per fare la panna montata [elettriche, da cucina]

source: Machines for washing clothing [electric]
it: Macchine per il lavaggio d'indumenti [elettriche]

source: Reversible flow filters [parts of machines]
it: Filtri a flusso reversibile [parti di macchine]

source: Drives for elevators
it: Comandi per elevatori

source: Grooving machines
it: Macchine scanalatrici

source: Guidance frameworks for machine tools
it: Strutture di guida per macchine utensili

source: Guillotine machines, other than for office use
it: Macchine a ghigliottina, non per ufficio

source: Gunning machines for lining furnances
it: Gunitatrici per il rivestimento di forni

source: Points [ignition parts for internal combustion engines]
it: Puntine [parti d'accensione per motori a combustione interna]

source: Perforated screens being parts of machines for sorting of materials
it: Schermi perforati che sono parti di macchine per la cernita di materiali

source: Printing machines for bank notes
it: Macchine per stampare banconote

source: Printing machines for electric duplicating processes
it: Macchine da stampa per procedimenti di duplicazione elettrici

source: Industrial cleaning machines [polishers]
it: Macchine pulitrici industriali [lucidatrici]

source: Rocket motor propulsion apparatus for weapons
it: Apparecchi di propulsione a motore a razzo per armamenti

source: Motor drive mechanisms [other than for land vehicles]
it: Meccanismi di trasmissione a motore [non per veicoli terrestri]

source: Ultrasonic cleaning instruments for industrial use
it: Strumenti di pulizia ad ultrasuoni per uso industriale

source: Ultrasonic washing machines
it: Lavatrici ad ultrasuoni

source: Machines for mixing foodstuffs
it: Macchine per miscelare alimenti

source: Hoppers [mechanical discharging]
it: Tramogge per lo scarico meccanico

source: Lifting installations for the transport of persons and goods
it: Impianti di sollevamento per il trasporto di persone e di merci

source: Electric power generators for emergency use
it: Generatori elettrici di emergenza

source: Amphibious bulldozers
it: Bulldozer anfibi

source: Spraying machines for use mounted on tractors
it: Irroratrici da montare su trattori

source: Spraying machines for use mounted on trailers
it: Macchine spruzzatrici da usare montate su rimorchi

source: Stacking machines for slabs
it: Macchine impilatrici per lastre

source: Standard shank drills [machines]
it: Punte del codolo standard [macchine]

source: Stands for lifting tables
it: Supporti per tavole elevatrici

source: Punching tools [parts of machines], other than office requisites
it: Utensili per punzonatura [parti di macchine], non articoli per ufficio

source: Workpiece slide tables [machines]
it: Piani di scorrimento pezzi [macchine]

source: Agricultural implements being trailer mounted
it: Strumenti agricoli montati su rimorchi

source: Hand held cordless power tools
it: Utensili elettrici manuali senza filo

source: Whisks [electric machines] for industrial purposes
it: Fruste [macchine elettriche] per uso industriale

source: Wire chain belts for machines
it: Cinghie a catena per macchine

source: Filters [parts of machines or engines]
it: Filtri [parti di macchine o di motori]

source: Boring robots for repairing the interiors of pipes
it: Robot di perforazione per la riparazione dell'interno di tubi

source: Linear actuators
it: Attuatori lineari

source: Machine operated platforms capable of elevation above ground level and used for storage
it: Piattaforme azionate da macchine in grado di elevarsi dal suolo ed utilizzate per l'immagazzinamento

source: Blades for aircraft turbines
it: Lame per turbine di velivoli

source: Blades for powered planes
it: Lame per pialle a motore

source: Vacuum cleaners for the cleaning of surfaces
it: Aspirapolvere per la pulizia di superfici

source: Non-woven wheels being parts of machines for use in scouring
it: Mole non tessute che sono parti di macchine per sgrassare

source: Guides for machines
it: Guide per macchine

source: Pulleys incorporating bearings [parts of machines]
it: Pulegge con cuscinetti incorporati [parti di macchine]

source: Steerable excavating machinery for earth displacement
it: Macchinari di scavo orientabili per lo spostamento di terra

source: Splash preventers [parts of machines]
it: Controspruzzi [parti di macchine]

source: Spline shank bits [parts of gearing for aircraft]
it: Punte con gambo a scanalatura [parti di ingranaggi per aerei]

source: Machine guides [parts of machines]
it: Guide per macchine [parti di macchine]

source: Roller tracks for use in roller conveyor apparatus
it: Binari a rulli per apparecchi trasportatori a rulli

source: Disengaging mechanisms being parts of machines
it: Meccanismi di disinnesto che sono parti di macchine

source: Injection stretch blow moulding machines
it: Macchine per iniezione-stiro-soffiaggio

source: Grease filters [parts of machines]
it: Filtri antigrasso [parti di macchine]

source: Industrial floor cleaning machines [vacuum cleaners]
it: Macchine industriali per la pulizia di pavimenti [aspirapolvere]

source: Attachments for excavators
it: Accessori per escavatori

source: Spray nozzles for attachment to pressure washing machines
it: Ugelli di spruzzatura da attaccare a macchine per lavaggio a pressione

source: Spray rollers being agricultural implements
it: Rulli spruzzatori che sono strumenti agricoli

source: Pressure multipliers for liquids
it: Moltiplicatori di pressione per liquidi

source: Pressure transformers
it: Trasformatori di pressione

source: Breakrock hammers [machines]
it: Martelli per la roccia [macchine]

source: Web fed rotary printing machines
it: Macchine rotative per stampa a bobina

source: Machines for making orange juice [electric]
it: Macchine per produrre succo d'arancia [elettriche]

source: Sound absorbers [silencers] being parts of vehicle exhaust systems
it: Assorbenti acustici [silenziatori] che sono parti di sistemi di scarico di veicoli

source: Spark arrestors being parts of machines
it: Parascintille che sono parti di macchine

source: Keys for securing borers [machine]
it: Chiavi per fissare alesatori [macchina]

source: Engine driven water pumps
it: Pompe per l'acqua a motore

source: Engines for compressors
it: Motori per compressori

source: Excavators for hydraulic expansion machines
it: Scavatrici per macchine idrauliche ad espansione

source: Camshafts for air vehicles
it: Alberi a camme per veicoli aerei

source: Belts for machines
it: Cinghie di macchine

source: Drilling heads [parts of machines]
it: Corone di sonda [parti di macchine]

source: Milling-drilling machines
it: Fresatrici-perforatrici

source: Combustion engines for aircraft
it: Motori a combustione per aerei

source: Combustion engines for machines
it: Motori a scoppio per macchine

source: Turbo-superchargers for vehicle engines
it: Turbocompressori per motori di veicoli

source: Grain husking machines
it: Decorticatori di cereali

source: Machines and apparatus for polishing [electric]
it: Macchine e apparecchi per levigare elettrici

source: Portable drilling machines [electric]
it: Perforatrici portatili [elettriche]

source: Potato mashers [electric machines]
it: Schiacciapatate [macchine elettriche]

source: Potato peelers [electric machines]
it: Pelapatate [macchine elettriche]

source: Link chains for driving purposes [other than for land vehicles]
it: Catene a maglie per guida [non per veicoli terrestri]

source: Front loaders for tractors
it: Caricatori frontali per trattori

source: Centrifugal separating machines for industrial use
it: Macchine separatrici centrifughe per uso industriale

source: Change speed transmissions [other than for land vehicles]
it: Trasmissioni del cambio di velocità [non per veicoli terrestri]

source: Cutting inserts [parts of machines]
it: Inserti da taglio [parti di macchine]

source: Cutting rollers [parts of machines]
it: Rulli da taglio [parti di macchine]

source: Cutting strips [parts of machines]
it: Nastri da taglio [parti di macchine]

source: Manipulators [machines] for industrial use
it: Manipolatori [macchine] per uso industriale

source: Automatic stamping machines
it: Affrancatrici automatiche

source: Block brakes [machine elements not for land vehicles]
it: Freni a ceppi [elementi di macchine non per veicoli terrestri]

source: Bailing machines
it: Imballatrici

source: Actuators incorporating a gear mechanism for pipeline valves
it: Azionatori comprendenti un meccanismo a ingranaggi per valvole per tubature

source: Adaptors for pipes [parts of machines]
it: Adattatori per tubi [parti di macchine]

source: Aerating pumps for aquaria
it: Pompe d'aerazione per acquari

source: Robots for use in industry
it: Robot per uso industriale

source: Robots for machine tools
it: Robot per macchine utensili

source: Rock drills [parts of machines]
it: Perforatori [parti di macchine]

source: Gas turbine engines
it: Motori a turbina a gas

source: Machine operated glue dispensers
it: Dosatori di colla a macchina

source: Spinning boxes for open-end rotor spinning machines
it: Unità di filatura per macchine di filatura a rotore aperto

source: Chisels for machines
it: Forbici di macchine

source: Passenger elevators for buildings
it: Ascensori per passeggeri per edifici

source: Clearing saws [machines]
it: Decespugliatori [macchine]

source: Power transmission belts for industrial machines
it: Cinture di trasmissione per macchine industriali

source: Power transmission couplings for aircraft
it: Giunti di trasmissione per aerei

source: Lawn edge trimmers [machines]
it: Tagliabordi per prato [macchine]

source: Lawn mowing attachments for vehicles
it: Accessori tagliaerba per veicoli

source: Setting presses [machines]
it: Presse di regolazione [macchine]

source: Sewing robots
it: Robot per cucire

source: Bearings for transmission shafts
it: Cuscinetti per alberi di trasmissione

source: Shafts for ball bushings
it: Alberi per bussole a sfere

source: Shaper cutters [machines]
it: Coltelli stozzatori [macchine]

source: Incorporators [agricultural implements]
it: Incorporatori [strumenti agricoli]

source: Air cleaners [air filters] for engines
it: Depuratori d'aria [filtri dell'aria] per motori

source: Alternators for land vehicles
it: Alternatori per veicoli terrestri

source: Tree branch pruners (Electric -)
it: Potatori per rami d'alberi (Elettrici -)

source: Potters' wheels
it: Torni da vasai

source: Servo motors for sewing machines
it: Servomotori per macchine per cucire

source: Hydraulic conveyors
it: Trasportatori idraulici

source: Internal grinding machines
it: Rettificatrici per interni

source: Pneumatic actuators for control valves
it: Azionatori pneumatici per il comando di valvole

source: Mechanical transmissions [other than for land vehicles]
it: Trasmissioni meccaniche [non per veicoli terrestri]

source: Sprung sheet metal guides [parts of machines]
it: Guinde in lamiera sospese [parti di macchine]

source: Agricultural spraying machines
it: Vaporizzatori per uso agricolo

source: Carpet shampoo applicators (Electric -)
it: Applicatori di shampoo per tappeti (Elettrici -)

source: Case loading machines
it: Macchine di carico casse

source: Damping rollers being parts of machines
it: Rulli bagnatori che sono parti di macchine

source: Blow pipes [gas-operated cutting apparatus]
it: Cannelli [apparecchi da taglio a gas]

source: Blow pipes being parts of gas cutting apparatus
it: Cannelli che sono parti di apparecchi per il taglio a gas

source: Rotating centres [parts of machines]
it: Contropunte girevoli [parti di macchine]

source: Rotating screw conveyors
it: Trasportatori a coclea rotanti

source: Longitudinal cutters for plastics materials
it: Trance longitudinali per materie plastiche

source: Diesel engines not for land vehicles
it: Motori diesel non per veicoli terrestri
